## 4.6 Merging and exporting data

### This script contains the following points:

#### 1. Import libraries
#### 2. Import data set into Jupyter as a new dataframe: df_ords_prior
#### 3. Check the dimensions of the imported dataframe
#### 4. Merge the dataframe with your df_ords dataframe
#### 5. Use the indicator argument to check for a full match between the two dataframes
#### 6. Exporting data in pickle format

### 1. Import libraries

In [1]:
# Import libraries

import pandas as pd 
import numpy as np
import os

In [2]:
# Import project folder path

path = r"03-11-23 Instacart Basket Analysis"

### 2. Import data set into Jupyter as a new dataframe: df_ords_prior

In [3]:
# Read orders data (current)

df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_checked.csv'), index_col = False)

In [4]:
# Read products data (current)

df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'products_checked.csv'), index_col = False)

In [5]:
# Read orders_products_prior dataset (new)

df_ords_prior = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'orders_products_prior.csv'), index_col = False)

### 3. Check the dimensions of the imported dataframe

In [6]:
# Check the output

df_ords_prior.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [7]:
# Check the output

df_ords.head()

,Unnamed: 0.1,Unnamed: 0,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order
0,0,0,2539329,1,1,2,8,NaN
1,1,1,2398795,1,2,3,7,15.0
2,2,2,473747,1,3,3,12,21.0
3,3,3,2254736,1,4,4,7,29.0
4,4,4,431534,1,5,4,15,28.0

##### note:

Found duplicate row identifier columns, unsure how they got there but am sure how to remove.

In [8]:
# Drop duplicate columns

columns_to_remove = ['Unnamed: 0.1', 'Unnamed: 0']

df_ords_1 = df_ords.drop(columns = columns_to_remove)

In [9]:
# Check new dataframe output for successful column removal

df_ords_1.head()

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0

In [10]:
# Check the shape

df_ords_prior.shape

(32434489, 4)

In [11]:
# Check the shape

df_ords_1.shape

(3421083, 6)

### 4. Merge the dataframe with your df_ords dataframe

In [12]:
# Merge df_ords_prior dataframe with your df_ords_1 dataframe

df_merged_large = df_ords_1.merge(df_ords_prior, on = 'order_id')

In [13]:
# Check the output

df_merged_large.head()

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered
0,2539329,1,1,2,8,NaN,196,1,0
1,2539329,1,1,2,8,NaN,14084,2,0
2,2539329,1,1,2,8,NaN,12427,3,0
3,2539329,1,1,2,8,NaN,26088,4,0
4,2539329,1,1,2,8,NaN,26405,5,0

### 5. Use the indicator argument to check for a full match between the two dataframes

In [14]:
# Merge df_ords_prior dataframe with your df_ords_1 dataframe

df_merged_large = df_ords_1.merge(df_ords_prior, on = 'order_id', indicator = True)

In [15]:
# Check the output

df_merged_large.head()

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,196,1,0,both
1,2539329,1,1,2,8,NaN,14084,2,0,both
2,2539329,1,1,2,8,NaN,12427,3,0,both
3,2539329,1,1,2,8,NaN,26088,4,0,both
4,2539329,1,1,2,8,NaN,26405,5,0,both

In [16]:
# Sum up all the values in the “_merge” column

df_merged_large['_merge'].value_counts()

_merge
both          32434489
left_only            0
right_only           0
Name: count, dtype: int64

### 6. Exporting data in pickle format

In [17]:
# Export data to pkl

df_merged_large.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_combined.pkl'))